Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEbu_regdef.h
/** \brief EBU Module Identification Register */
typedef struct _Ifx_EBU_ID_Bits
{
    Ifx_UReg_32Bit ID_VALUE:32;       /**< \brief [31:0] Module Identification Value - ID_VALUE (r) */
} Ifx_EBU_ID_Bits;

/** \brief EBU Configuration Register */
typedef struct _Ifx_EBU_MODCON_Bits
{
    Ifx_UReg_32Bit STS:1;             /**< \brief [0:0] Memory Status Bit - STS (r) */
    Ifx_UReg_32Bit LCKABRT:1;         /**< \brief [1:1] Lock Abort - LCKABRT (rwh) */
    Ifx_UReg_32Bit SDTRI:1;           /**< \brief [2:2] SDRAM Tristate - SDTRI (rw) */
    Ifx_UReg_32Bit CLK_COMB:1;        /**< \brief [3:3] Combined External Bus Clock - CLK_COMB (rw) */
    Ifx_UReg_32Bit EXTLOCK:1;         /**< \brief [4:4] External Bus Lock Control - EXTLOCK (rw) */
    Ifx_UReg_32Bit ARBSYNC:1;         /**< \brief [5:5] Arbitration Signal Synchronization Control - ARBSYNC (rw) */
    Ifx_UReg_32Bit ARBMODE:2;         /**< \brief [7:6] Arbitration Mode Selection - ARBMODE (rw) */
    Ifx_UReg_32Bit TIMEOUTC:8;        /**< \brief [15:8] Bus Time-out Control - TIMEOUTC (rw) */
    Ifx_UReg_32Bit LOCKTIMEOUT:8;     /**< \brief [23:16] Lock Timeout Counter Preload - LOCKTIMEOUT (rw) */
    Ifx_UReg_32Bit reserved_24:1;     /**< \brief [24:24] \internal Reserved */
    Ifx_UReg_32Bit FAST_SRI:1;        /**< \brief [25:25] Clock Cycles used for SRI Address Decode - FAST_SRI (rw) */
    Ifx_UReg_32Bit OCDS_SUSP_DIS:1;    /**< \brief [26:26] OCDS SUSPEND Disable - OCDS_SUSP_DIS (rw) */
    Ifx_UReg_32Bit reserved_27:3;     /**< \brief [29:27] \internal Reserved */
    Ifx_UReg_32Bit BUSSTATE:1;        /**< \brief [30:30] External Bus State - BUSSTATE (rh) */
    Ifx_UReg_32Bit ALE:1;             /**< \brief [31:31] ALE Mode - ALE (rw) */
} Ifx_EBU_MODCON_Bits;

/** \brief EBU SDRAM Control Register */
typedef struct _Ifx_EBU_SDR_CON_Bits
{
    Ifx_UReg_32Bit CRAS:4;            /**< \brief [3:0] Row to precharge delay counter - CRAS (rw) */
    Ifx_UReg_32Bit CRFSH:4;           /**< \brief [7:4] Initialization refresh commands counter - CRFSH (rw) */
    Ifx_UReg_32Bit CRSC:2;            /**< \brief [9:8] Mode register set-up time - CRSC (rw) */
    Ifx_UReg_32Bit CRP:2;             /**< \brief [11:10] Row precharge time counter - CRP (rw) */
    Ifx_UReg_32Bit AWIDTH:2;          /**< \brief [13:12] Width of column address - AWIDTH (rw) */
    Ifx_UReg_32Bit CRCD:2;            /**< \brief [15:14] Row to column delay counter - CRCD (rw) */
    Ifx_UReg_32Bit CRC:6;             /**< \brief [21:16] Refresh cycle time counter - CRC (rw) */
    Ifx_UReg_32Bit BANKM:3;           /**< \brief [24:22] Mask for bank tag - BANKM (rw) */
    Ifx_UReg_32Bit reserved_25:3;     /**< \brief [27:25] \internal Reserved */
    Ifx_UReg_32Bit CLKDIS:1;          /**< \brief [28:28] Disable SDRAM clock output - CLKDIS (rw) */
    Ifx_UReg_32Bit PWR_MODE:2;        /**< \brief [30:29] Power Save Mode used for gated clock mode - PWR_MODE (rw) */
    Ifx_UReg_32Bit SDCMSEL:1;         /**< \brief [31:31] SDRAM clock mode select - SDCMSEL (rw) */
} Ifx_EBU_SDR_CON_Bits;

/** \brief EBU SDRAM Mode Register */
typedef struct _Ifx_EBU_SDR_MOD_Bits
{
    Ifx_UReg_32Bit BURSTL:3;          /**< \brief [2:0] Burst length - BURSTL (rw) */
    Ifx_UReg_32Bit BTYP:1;            /**< \brief [3:3] Burst type - BTYP (rw) */
    Ifx_UReg_32Bit CASLAT:3;          /**< \brief [6:4] CAS latency - CASLAT (rw) */
    Ifx_UReg_32Bit OPMODE:7;          /**< \brief [13:7] Operation Mode - OPMODE (rw) */
    Ifx_UReg_32Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_32Bit COLDSTART:1;       /**< \brief [15:15] SDRAM coldstart - COLDSTART (w) */
    Ifx_UReg_32Bit XOPM:14;           /**< \brief [29:16] Extended Operation Mode - XOPM (rw) */
    Ifx_UReg_32Bit XBA:2;             /**< \brief [31:30] Extended Operation Bank Select - XBA (rw) */
} Ifx_EBU_SDR_MOD_Bits;

/** \brief EBU SDRAM Refresh Control Register */
typedef struct _Ifx_EBU_SDR_REF_Bits
{
    Ifx_UReg_32Bit REFRESHC:6;        /**< \brief [5:0] Refresh counter period - REFRESHC (rw) */
    Ifx_UReg_32Bit REFRESHR:3;        /**< \brief [8:6] Number of refresh commands - REFRESHR (rw) */
    Ifx_UReg_32Bit SELFREXST:1;       /**< \brief [9:9] Self Refresh Exit Status. - SELFREXST (rh) */
    Ifx_UReg_32Bit SELFREX:1;         /**< \brief [10:10] Self Refresh Exit (Power Up). - SELFREX (rw) */
    Ifx_UReg_32Bit SELFRENST:1;       /**< \brief [11:11] Self Refresh Entry Status. - SELFRENST (rh) */
    Ifx_UReg_32Bit SELFREN:1;         /**< \brief [12:12] Self Refresh Entry - SELFREN (rw) */
    Ifx_UReg_32Bit AUTOSELFR:1;       /**< \brief [13:13] Automatic Self Refresh - AUTOSELFR (rw) */
    Ifx_UReg_32Bit ERFSHC:2;          /**< \brief [15:14] Extended Refresh Counter Period - ERFSHC (rw) */
    Ifx_UReg_32Bit SELFREX_DLY:8;     /**< \brief [23:16] Self Refresh Exit Delay - SELFREX_DLY (rw) */
    Ifx_UReg_32Bit ARFSH:1;           /**< \brief [24:24] Auto Refresh on Self refresh Exit - ARFSH (rw) */
    Ifx_UReg_32Bit RES_DLY:3;         /**< \brief [27:25] Delay on Power Down Exit - RES_DLY (rw) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_EBU_SDR_REF_Bits;

/** \brief EBU SDRAM Status Register */
typedef struct _Ifx_EBU_SDR_STAT_Bits
{
    Ifx_UReg_32Bit REFERR:1;          /**< \brief [0:0] SDRAM Refresh Error - REFERR (rwh) */
    Ifx_UReg_32Bit SDRMBUSY:1;        /**< \brief [1:1] SDRAM Busy - SDRMBUSY (rh) */
    Ifx_UReg_32Bit SDERR:1;           /**< \brief [2:2] SDRAM read error - SDERR (rwh) */
    Ifx_UReg_32Bit reserved_3:29;     /**< \brief [31:3] \internal Reserved */
} Ifx_EBU_SDR_STAT_Bits;

/** \brief EBU Test/Control Configuration Register */
typedef struct _Ifx_EBU_USERCON_Bits
{
    Ifx_UReg_32Bit DIP:1;             /**< \brief [0:0] Disable Internal Pipelining - DIP (rw) */
    Ifx_UReg_32Bit NAF:7;             /**< \brief [7:1] No Assigned Function - NAF (rw) */
    Ifx_UReg_32Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
    Ifx_UReg_32Bit ADDIO:4;           /**< \brief [19:16] Address Pins to GPIO Mode - ADDIO (rw) */
    Ifx_UReg_32Bit reserved_20:8;     /**< \brief [27:20] \internal Reserved */
    Ifx_UReg_32Bit BCEN:2;            /**< \brief [29:28] Byte Control Enable - BCEN (r) */
    Ifx_UReg_32Bit ADVIO:1;           /**< \brief [30:30] ADV Pin to GPIO Mode - ADVIO (rw) */
    Ifx_UReg_32Bit ADDLSW:1;          /**< \brief [31:31] Enable Address LSW, A(15:0) for GPIO - ADDLSW (rw) */
} Ifx_EBU_USERCON_Bits;

